tap 'homebrew/cask-fonts'

# Apps
cask 'font-hack-nerd-font'
cask 'keepassx'
cask 'docker-desktop'
cask 'iterm2'
cask 'visual-studio-code'
cask 'rectangle'
cask 'just'

cask 'google-chrome'
cask 'vlc'
cask 'gcloud-cli'
cask 'gh'

cask 'slack'
cask '1password'
cask 'zoom'
cask 'vagrant'

cask 'microsoft-remote-desktop'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'sketchbook'
cask 'onedrive'
