brew 'zsh'
brew 'zsh-completions'

brew 'shellcheck'
brew 'bats-core'
brew 'gh'
brew 'git-extras'

# ensure later versions 
brew 'bash'
brew 'wget'
brew 'hurl'
brew 'curl'
brew 'htop'
brew 'btop'
brew 'bmon'

brew 'tmux'
brew 'tmuxinator'    

brew 'git'

brew 'imagemagick'

brew 'jq'
brew 'yq'

brew 'dive'
brew 'container-diff'
brew 'container-structure-test'
brew 'oras'

brew 'awscli'

brew 'tfenv'
brew 'terraform-docs'

brew 'kubectx'
brew 'skaffold'
brew 'kubernetes-cli'
brew 'helm'
brew 'k9s'
brew 'yamllint'


brew 'pyenv'
brew 'pipenv'
brew 'poetry'
brew 'cookiecutter'

brew 'nvm'

brew 'nmap'

brew 'ffmpeg'

brew 'glab'
brew 'hurl'

brew 'gpg'
brew 'ssh-copy-id'
brew 'watch'

brew 'kind'
brew 'youtube-dl'
brew 'gomplate'

brew 'just'

brew 'chezmoi'

brew 'pre-commit'
brew 'dos2unix'


tap 'romkatv/powerlevel10k'
brew "powerlevel10k"