tap 'homebrew/cask-fonts'

brew 'bash'
brew 'zsh'
brew 'zsh-completions'
brew 'shellcheck'
brew 'bats-core'

brew 'git'
brew 'gh'
brew 'git-extras'
brew 'gpg'

brew 'imagemagick'

brew 'jq'
brew 'yq'

brew 'dive'
brew 'container-diff'
brew 'container-structure-test'

brew 'ssh-copy-id'
brew 'watch'
brew 'wget'
brew 'curl'

brew 'tmux'
brew 'tmuxinator'    

# whiptail
brew "newt"
brew 'htop'

brew "romkatv/powerlevel10k/powerlevel10k"

brew 'awscli'

brew 'tfenv'
brew 'terraform-docs'

brew 'kubectx'
brew 'skaffold'
brew 'kubernetes-cli'
brew 'kind'
brew 'kubernetes-helm'

brew 'pyenv'
brew 'pipenv'

brew 'nvm'
brew 'nmap'
brew 'youtube-dl'
brew 'gomplate'

brew 'ansible'
brew 'ffmpeg'

# Apps
cask '1password'
cask 'font-hack-nerd-font'
cask 'keepassx'
cask 'keybase' 
cask 'homebrew/cask/docker'
cask 'google-chrome'
cask 'vagrant'
cask 'vlc'
cask 'hex-fiend'
cask 'slack'
cask 'spotify'
cask 'discord'
cask 'pritunl'
cask 'visual-studio-code'
cask 'sketchbook'
cask 'onedrive'
cask 'microsoft-remote-desktop'
cask 'zoom'


cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'google-chrome'
cask 'iterm2'
cask 'spectacle'
