tap 'homebrew/cask-fonts'

# Apps
cask '1password'
cask 'font-hack-nerd-font'
cask 'keepassx'
cask 'keybase' 
cask 'homebrew/cask/docker'
cask 'google-chrome'
cask 'vagrant'
cask 'vlc'
cask 'hex-fiend'
cask 'slack'
cask 'spotify'
cask 'discord'
cask 'visual-studio-code'
cask 'sketchbook'
cask 'onedrive'
cask 'microsoft-remote-desktop'
cask 'zoom'


cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'google-chrome'
cask 'iterm2'
cask 'spectacle'
